# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.
import math
A1, A2, A3, A4 = (4, 6), (0, 4), (8, 2), (12, 4)
def parall(a, b, c, d):

    p1 = False
    p2 = False

    ab = math.sqrt((b[0] - a[0])**2 + (b[1] - a[1])**2)
    cb = math.sqrt((b[0] - c[0])**2 + (b[1] - c[1])**2)
    cd = math.sqrt((d[0] - c[0])**2 + (d[1] - c[1])**2)
    ad = math.sqrt((d[0] - a[0])**2 + (d[1] - a[1])**2)
    if ab == cd and cb == ad:
        print('Стороны Равны')
        p1 = True
    else:
        print('Противолежащие стороны не равны')

    hO1 = ((a[0] + c[0])/2, (a[1] + c[1])/2)
    hO2 = ((b[0] + d[0])/2, (b[1] + d[1])/2)
    if hO1 == hO2:
        print('Половины диагоналей равны')
        p2 = True
    else:
        print('Половины диагоналей не равны')

    if p1 and p2:
        print('Вершины A1, A2, A3, A4 являются вершинами параллелограмма')

    else:
        print('фигура не является параллелогрпммом')

parall(A1, A2, A3, A4)